cask_args appdir: "/Applications"

tap "homebrew/cask"
tap "heroku/brew"
tap "homebrew/cask-drivers"
tap "nodenv/nodenv"
tap "golangci/tap"
tap "dart-lang/dart"

# brew "libxml2"  # nokogiri uses it
brew "git"
brew "gh"

brew "rbenv"
brew "rbenv-default-gems"
brew "nodenv"
brew "nodenv/nodenv/nodenv-default-packages"
brew "go"

cask "android-studio"
brew "cocoapods"
brew "dart"

# plantuml
# brew "openjdk"
# brew "graphviz"

brew "tree"
brew "jq"
brew "httpie"

cask "google-chrome"
cask 'microsoft-edge'
cask "slack"

cask "visual-studio-code"
cask "gitup"

cask "sequel-ace"
cask "rancher"
cask "amazon-workspaces"

cask "google-japanese-ime"
cask "zoom"

cask "QLStephen"
cask "QLColorCode"
cask "QLMarkdown"
cask "quicklook-json"

cask "via"
cask "qmk-toolbox"
cask "karabiner-elements"
cask "clipy"
cask "witch"
cask "rectangle"
cask "itsycal"
cask "caffeine"
